<?php

/* blog/index.html.twig */
class __TwigTemplate_d03768899f64a003df592831bb971c65f399feec94202205283dff76cdb280d0 extends Twig_Template
{
    public function __construct(Twig_Environment $env)
    {
        parent::__construct($env);

        // line 1
        $this->parent = $this->loadTemplate("base.html.twig", "blog/index.html.twig", 1);
        $this->blocks = array(
            'main' => array($this, 'block_main'),
        );
    }

    protected function doGetParent(array $context)
    {
        return "base.html.twig";
    }

    protected function doDisplay(array $context, array $blocks = array())
    {
        $__internal_537b877c5d524f934b8595b6d4d20c7de970c69a116d2eb3616f2ec1b66d0373 = $this->env->getExtension("Symfony\\Bridge\\Twig\\Extension\\ProfilerExtension");
        $__internal_537b877c5d524f934b8595b6d4d20c7de970c69a116d2eb3616f2ec1b66d0373->enter($__internal_537b877c5d524f934b8595b6d4d20c7de970c69a116d2eb3616f2ec1b66d0373_prof = new Twig_Profiler_Profile($this->getTemplateName(), "template", "blog/index.html.twig"));

        $this->parent->display($context, array_merge($this->blocks, $blocks));
        
        $__internal_537b877c5d524f934b8595b6d4d20c7de970c69a116d2eb3616f2ec1b66d0373->leave($__internal_537b877c5d524f934b8595b6d4d20c7de970c69a116d2eb3616f2ec1b66d0373_prof);

    }

    // line 3
    public function block_main($context, array $blocks = array())
    {
        $__internal_f64753ea740e023ee1bcba7064a2218935e9fc46110172dcc44a528dd8a03a2a = $this->env->getExtension("Symfony\\Bridge\\Twig\\Extension\\ProfilerExtension");
        $__internal_f64753ea740e023ee1bcba7064a2218935e9fc46110172dcc44a528dd8a03a2a->enter($__internal_f64753ea740e023ee1bcba7064a2218935e9fc46110172dcc44a528dd8a03a2a_prof = new Twig_Profiler_Profile($this->getTemplateName(), "block", "main"));

        // line 4
        echo "    <div class=\"mainContent\">
        <div class=\"content\">
            <article class=\"topcontent\">
                <header>
                    <h2><a href=\"#\"title=\"First post\">First Post</a></h2>
                </header>

                <footer>
                    <p class=\"post-info\">This post is written by Chrystoian</p>
                </footer>
                <content>
                    <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, подхвърляйки го във въздуха.

                        Тестото се покрива с домати или доматен сос. Добавките след това са обосновани от традиционната кухня или определен вкус. Класическата пица се пече в специална пещ (горяща с дърва), много бързо и при много висока температура (обичайно в нагрята до около 200 °C фурна, пече се за около 10 - 12 минути). В САЩ се прави „американска“ пица, с много по-дебела кора, изискваща по-дълго време за печене.

                        Класическите разновидности на италианската пица са: „Маргарита“, „Капричоза“, „Диавола“, „Калцоне“, „Везувий“, „Четири сирена“, „Римска“, „Рукола“, „Хавайска“, „Маринара“ и много други.

                        Съдържа следните съставки:</p>
                </content>
            </article>

            <article class=\"bottomcontent\">
                <header>
                    <h2><a href=\"#\"title=\"Second post\">Second Post</a></h2>
                </header>

                <footer>
                    <p class=\"post-info\">This post is written by Chrystoian</p>
                </footer>
                <content>
                    <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, подхвърляйки го във въздуха.

                        Тестото се покрива с домати или доматен сос. Добавките след това са обосновани от традиционната кухня или определен вкус. Класическата пица се пече в специална пещ (горяща с дърва), много бързо и при много висока температура (обичайно в нагрята до около 200 °C фурна, пече се за около 10 - 12 минути). В САЩ се прави „американска“ пица, с много по-дебела кора, изискваща по-дълго време за печене.

                        Класическите разновидности на италианската пица са: „Маргарита“, „Капричоза“, „Диавола“, „Калцоне“, „Везувий“, „Четири сирена“, „Римска“, „Рукола“, „Хавайска“, „Маринара“ и много други.

                        Съдържа следните съставки:</p>
                </content>
            </article>
        </div>
    </div>

    <aside class=\"top-sidebar\">
        <article>
            <h2>Top sidebar</h2>
            <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, </p>
        </article>
    </aside>

    <aside class=\"middle-sidebar\">
        <article>
            <h2>Middle sidebar</h2>
            <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, </p>
        </article>
    </aside>

    <aside class=\"bottom-sidebar\">
        <article>
            <h2>Bottom sidebar</h2>
            <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, </p>
        </article>
    </aside>
";
        
        $__internal_f64753ea740e023ee1bcba7064a2218935e9fc46110172dcc44a528dd8a03a2a->leave($__internal_f64753ea740e023ee1bcba7064a2218935e9fc46110172dcc44a528dd8a03a2a_prof);

    }

    public function getTemplateName()
    {
        return "blog/index.html.twig";
    }

    public function isTraitable()
    {
        return false;
    }

    public function getDebugInfo()
    {
        return array (  40 => 4,  34 => 3,  11 => 1,);
    }

    public function getSource()
    {
        return "{% extends 'base.html.twig' %}

{% block main %}
    <div class=\"mainContent\">
        <div class=\"content\">
            <article class=\"topcontent\">
                <header>
                    <h2><a href=\"#\"title=\"First post\">First Post</a></h2>
                </header>

                <footer>
                    <p class=\"post-info\">This post is written by Chrystoian</p>
                </footer>
                <content>
                    <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, подхвърляйки го във въздуха.

                        Тестото се покрива с домати или доматен сос. Добавките след това са обосновани от традиционната кухня или определен вкус. Класическата пица се пече в специална пещ (горяща с дърва), много бързо и при много висока температура (обичайно в нагрята до около 200 °C фурна, пече се за около 10 - 12 минути). В САЩ се прави „американска“ пица, с много по-дебела кора, изискваща по-дълго време за печене.

                        Класическите разновидности на италианската пица са: „Маргарита“, „Капричоза“, „Диавола“, „Калцоне“, „Везувий“, „Четири сирена“, „Римска“, „Рукола“, „Хавайска“, „Маринара“ и много други.

                        Съдържа следните съставки:</p>
                </content>
            </article>

            <article class=\"bottomcontent\">
                <header>
                    <h2><a href=\"#\"title=\"Second post\">Second Post</a></h2>
                </header>

                <footer>
                    <p class=\"post-info\">This post is written by Chrystoian</p>
                </footer>
                <content>
                    <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, подхвърляйки го във въздуха.

                        Тестото се покрива с домати или доматен сос. Добавките след това са обосновани от традиционната кухня или определен вкус. Класическата пица се пече в специална пещ (горяща с дърва), много бързо и при много висока температура (обичайно в нагрята до около 200 °C фурна, пече се за около 10 - 12 минути). В САЩ се прави „американска“ пица, с много по-дебела кора, изискваща по-дълго време за печене.

                        Класическите разновидности на италианската пица са: „Маргарита“, „Капричоза“, „Диавола“, „Калцоне“, „Везувий“, „Четири сирена“, „Римска“, „Рукола“, „Хавайска“, „Маринара“ и много други.

                        Съдържа следните съставки:</p>
                </content>
            </article>
        </div>
    </div>

    <aside class=\"top-sidebar\">
        <article>
            <h2>Top sidebar</h2>
            <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, </p>
        </article>
    </aside>

    <aside class=\"middle-sidebar\">
        <article>
            <h2>Middle sidebar</h2>
            <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, </p>
        </article>
    </aside>

    <aside class=\"bottom-sidebar\">
        <article>
            <h2>Bottom sidebar</h2>
            <p>Класическото тесто за пица се приготвя от брашно, мая, захар, сол, зехтин и вода. Тестото се меси на ръка, след което втасва определено време и се разточва на тънък пласт (обикновено с дебелина 0,5 см.). Майсторите на пица използват зрелищен начин за разточване на тестото, </p>
        </article>
    </aside>
{% endblock %}

";
    }
}
